Revit 2026 API

# SketchProfile Property

---

Returns the Profile of the Sketch.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public CurveArrArray Profile { get; }
```
```vb
Public ReadOnly Property Profile As CurveArrArray
	Get
```
```cpp
public:
property CurveArrArray^ Profile {
	CurveArrArray^ get ();
}
```
```fsharp
member Profile : CurveArrArray with get
```

#### Property Value

CurveArrArray

This property is used to retrieve the Profile of Sketch.

#### Reference

Sketch Class

Autodesk.Revit.DB Namespace